{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"dense_3_input:0": {"name": "dense_3_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "600"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "dense_3_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "600"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^dense_3_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^dense_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^dense_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^dense_3_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^dense_3_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^dense_3_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/Relu", "op": "_FusedMatMul", "input": ["dense_3_input", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_3/Relu", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_4/Relu", "Func/StatefulPartitionedCall/input/_6", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_2", "shape": [600, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [64, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [64], "dtype": "float32"}]}]}